---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.NonManifoldEdge
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.NonManifoldEdge

Same edge is used by more than two faces.
 This issue can be posted for topologically impossible face sets
 as well as for face sets with duplicate faces.
 Associated numbers are face and loop in which the problem became
 obvious indices respectively.